[{"date":"2019-01-01","name":"🇺🇸 New Year's Day","flag_day":1,"url":"https:\/\/en.wikipedia.org\/wiki\/New_Year%27s_Day","description":"New Year's Day is observed on January 1, the first day of the year on the modern Gregorian calendar as well as the Julian calendar used in ancient Rome. With most countries using the Gregorian calendar as their main calendar, New Year's Day is the closest thing to being the world's only truly global public holiday, often celebrated with fireworks at the stroke of midnight as the new year starts. January 1 on the Julian calendar currently corresponds to January 14 on the Gregorian calendar, and it is on that date that followers of some of the Eastern Orthodox churches celebrate the New Year."},{"date":"2019-01-21","name":"🇺🇸 Martin Luther King, Jr. Day","flag_day":1,"age":90,"url":"https:\/\/en.wikipedia.org\/wiki\/Martin_Luther_King,_Jr._Day","description":"Martin Luther King, Jr. Day is a United States federal holiday marking the birthday of Rev. Dr. Martin Luther King, Jr. It is observed on the third Monday of January each year, which is around the time of King's birthday, January 15. The floating holiday is similar to holidays set under the Uniform Monday Holiday Act, though the act predated the establishment of Martin Luther King, Jr. Day by 15 years."},{"date":"2019-02-12","name":"🇺🇸 Lincoln's Birthday","flag_day":1,"age":210,"url":"https:\/\/en.wikipedia.org\/wiki\/Lincoln%27s_Birthday","description":"Lincoln's Birthday is a legal holiday in some U.S. states including California, Connecticut, Illinois, Missouri, New Jersey, New York, and Indiana. It is observed on the anniversary of Abraham Lincoln's birth on February 12, 1809."},{"date":"2019-02-18","name":"🇺🇸 President's Day","flag_day":1,"age":287,"url":"https:\/\/en.wikipedia.org\/wiki\/Presidents%27_Day","description":"Washington's Birthday is a United States federal holiday celebrated on the third Monday of February in honor of George Washington, the first President of the United States. It is also commonly known as Presidents Day (sometimes spelled Presidents' Day or President's Day). As Washington's Birthday or Presidents Day, it is also the official name of a concurrent state holiday celebrated on the same day in a number of states."},{"date":"2019-05-15","name":"🇺🇸 Peace Officers Memorial Day","flag_day":1,"age":58,"url":"https:\/\/en.wikipedia.org\/wiki\/Peace_Officers_Memorial_Day","description":"Peace Officers Memorial Day and Police Week is an observance in the United States that pays tribute to the local, state, and Federal peace officers. The Memorial takes place on May 15, and Police Week is the calendar week in which the Memorial falls."},{"date":"2019-05-18","name":"🇺🇸 Armed Forces Day","flag_day":1,"age":70,"url":"https:\/\/en.wikipedia.org\/wiki\/Armed_Forces_Day#United_States","description":"In the United States, Armed Forces Day is celebrated on the third Saturday in May. It falls near the end of Armed Forces Week, which begins on the second Saturday of May and ends on the third Sunday of May.\n\nThe day was created in 1949 to honor Americans serving in the five U.S. military branches - the Army, Navy, Marines, Air Force, and Coast Guard - following the consolidation of the military services in the Department of Defense. It was intended to replace the separate Army, Navy, Air Force, Marine Corps, and Coast Guard Days, but the separate days are still observed, especially within the respective services."},{"date":"2019-05-27","name":"🇺🇸 Memorial Day","flag_day":1,"age":154,"url":"https:\/\/en.wikipedia.org\/wiki\/Memorial_Day","description":"Memorial Day is a United States federal holiday observed annually on the last Monday of May. Formerly known as Decoration Day, it originated after the American Civil War to commemorate the fallen Union soldiers of the Civil War. (Southern ladies organizations and southern schoolchildren had decorated Confederate graves in Richmond and other cities during the Civil War, but each region had its own date. Most dates were in May.) By the 20th century Memorial Day had been extended to honor all Americans who have died in all wars. Memorial Day is a day of remembering the men and women who died while serving in the United States Armed Forces. As a marker it typically marks the start of the summer vacation season, while Labor Day marks its end."},{"date":"2019-06-14","name":"🇺🇸 Flag Day","flag_day":1,"age":242,"url":"https:\/\/en.wikipedia.org\/wiki\/Flag_Day_%28United_States%29","description":"In the United States Flag Day is celebrated on June 14. It commemorates the adoption of the flag of the United States, which happened that day by resolution of the Second Continental Congress in 1777. The United States Army also celebrates the Army Birthday on this date; Congress adopted \"the American continental army\" after reaching a consensus position in the Committee of the Whole on June 14, 1775."},{"date":"2019-07-04","name":"🇺🇸 Independence Day","flag_day":1,"alternate_names":"Fourth of July","age":243,"url":"https:\/\/en.wikipedia.org\/wiki\/Independence_Day_(US)","description":"Independence Day, commonly known as the Fourth of July, is a federal holiday in the United States commemorating the adoption of the Declaration of Independence on July 4, 1776, declaring independence from the Kingdom of Great Britain. Independence Day is commonly associated with fireworks, parades, barbecues, carnivals, fairs, picnics, concerts, baseball games, family reunions, and political speeches and ceremonies, in addition to various other public and private events celebrating the history, government, and traditions of the United States. Independence Day is the national day of the United States."},{"date":"2019-07-27","name":"🇺🇸 Korean War Veterans Day","flag_day":1,"age":66,"url":"http:\/\/www.kwva.org\/","description":"The Korean War (25 June 1950 - 27 July 1953) was a war between the Republic of Korea (supported primarily by the United States of America, with contributions from allied nations under the aegis of the United Nations) and the Democratic People's Republic of Korea (supported by the People's Republic of China, with military and material aid from the Union of Soviet Socialist Republics). The Korean War was primarily the result of the physical division of Korea by an agreement of the victorious Allies at the conclusion of the Pacific War at the end of World War II. The Korean peninsula was ruled by the Empire of Japan from 1910 until the end of World War II. Following the surrender of the Empire of Japan in September of 1945, American administrators divided the peninsula along the 38th parallel, with U.S. military forces occupying the southern half and Soviet military forces occupying the northern half."},{"date":"2019-09-02","name":"🇺🇸 Labor Day","flag_day":1,"age":137,"url":"https:\/\/en.wikipedia.org\/wiki\/Labor_Day","description":"Labor Day is a United States federal holiday observed on the first Monday in September that celebrates the economic and social contributions of workers."},{"date":"2019-09-11","name":"🇺🇸 Patriot Day","flag_day":1,"age":18,"url":"https:\/\/en.wikipedia.org\/wiki\/Patriot_Day","description":"In the United States, Patriot Day occurs on September 11 of each year, designated in memory of the 2,977 killed in the September 11, 2001 terrorist attacks. Most Americans who were alive during the events refer to the day as \"Nine-Eleven (9\/11)\", \"September Eleventh\", or some variation thereof. Initially, the day was called the Prayer and Remembrance for the Victims of the Terrorist Attacks on September 11, 2001."},{"date":"2019-09-17","name":"🇺🇸 Constitution Day","flag_day":1,"alternate_names":"Citizenship Day","age":232,"url":"https:\/\/en.wikipedia.org\/wiki\/Constitution_Day_(United_States)","description":"Constitution Day (or Citizenship Day) is an American federal observance that recognizes the adoption of the United States Constitution and those who have become U.S. citizens. It is observed on September 17, the day the U.S. Constitutional Convention signed the Constitution in 1787."},{"date":"2019-10-06","name":"🇺🇸 Fire Prevention Day","flag_day":1,"age":94,"url":"https:\/\/en.wikipedia.org\/wiki\/Fire_Prevention_Week","description":"Fire Prevention Week is observed in the United States and Canada, during the week (from Sunday to Saturday) in which October 9 falls. In the United States, the first Presidential proclamation of Fire Prevention Week was made in 1925 by President Calvin Coolidge. The National Fire Protection Association (NFPA) continues to be the international sponsor of the week.\n\nIn Canada, Fire Prevention Week is proclaimed annually by the Governor General. The Saturday ending the week is also proclaimed as Fire Service Recognition Day to express appreciation for the many public services rendered by members of the Canadian fire service."},{"date":"2019-10-14","name":"🇺🇸 Columbus Day","flag_day":1,"age":527,"url":"https:\/\/en.wikipedia.org\/wiki\/Columbus_Day","description":"Many countries in the New World and elsewhere celebrate the anniversary of Christopher Columbus's arrival in the Americas, which occurred on October 12, 1492, as an official holiday."},{"date":"2019-10-27","name":"🇺🇸 Navy Day","flag_day":1,"age":97,"url":"https:\/\/en.wikipedia.org\/wiki\/Navy_Day#United_States","description":"In the United States, the Navy League of the United States organized the first Navy Day in 1922, holding it on October 27 because it was the birthday of the navy-obsessed President Theodore Roosevelt. Although meeting with mixed reviews the first year, in 1923 over 50 major cities participated, and the United States Navy sent a number of its ships to various port cities for the occasion. The 1945 Navy Day was an especially large celebration, with President Harry S. Truman reviewing the fleet in New York Harbor."},{"date":"2019-11-05","name":"🇺🇸 Election Day","flag_day":1,"url":"https:\/\/en.wikipedia.org\/wiki\/Election_Day_%28United_States%29"},{"date":"2019-11-11","name":"🇺🇸 Veterans Day","flag_day":1,"age":101,"url":"https:\/\/en.wikipedia.org\/wiki\/Veterans_Day","description":"Veterans Day, formerly Armistice Day, is an annual United States holiday honoring armed service veterans. It is a federal holiday that is observed on November 11. It coincides with other holidays such as Armistice Day or Remembrance Day, which are celebrated in other parts of the world and also mark the anniversary of the signing of the Armistice that ended World War I. (Major hostilities of World War I were formally ended at the 11th hour of the 11th day of the 11th month of 1918 with the German signing of the Armistice.)"},{"date":"2019-11-28","name":"🇺🇸 Thanksgiving Day","flag_day":1,"age":156,"url":"https:\/\/en.wikipedia.org\/wiki\/Thanksgiving_(United_States)","description":"Thanksgiving, or Thanksgiving Day, is a holiday celebrated in the United States on the fourth Thursday in November. It has officially been an annual tradition since 1863, when, during the Civil War, President Abraham Lincoln proclaimed a national day of \"Thanksgiving and Praise to our beneficent Father who dwelleth in the Heavens\", to be celebrated on Thursday, November 26. As a federal and popular holiday in the U.S., Thanksgiving is one of the major holidays of the year. Together with Christmas and the New Year, Thanksgiving is a part of the broader holiday season."},{"date":"2019-12-07","name":"🇺🇸 Pearl Harbor Rememberance Day","flag_day":1,"age":78,"url":"https:\/\/en.wikipedia.org\/wiki\/Pearl_Harbor_Remembrance_Day","description":"Pearl Harbor Remembrance Day, which is observed annually on December 7, is to remember and honor all those who died in the attack on Pearl Harbor on December 7, 1941. On August 23, 1994, United States Congress, by Pub.L. 103-308, designated December 7 of each year as National Pearl Harbor Remembrance Day. National Pearl Harbor Remembrance Day is also referred to as Pearl Harbor Remembrance Day or Pearl Harbor Day. It is a tradition to fly the Flag of the United States at half-staff until sunset in honor of dead patriots."}]